USE `seschool_09`;

DROP TABLE IF EXISTS `Items`;
DROP TABLE IF EXISTS `Players`;
DROP TABLE IF EXISTS `Guilds`;

CREATE TABLE `Guilds`
(
	`guild_id` INT PRIMARY KEY AUTO_INCREMENT,
	`guild_name` VARCHAR(50),
	`guild_level` INT
);

CREATE TABLE `Players`
(
	`player_id` INT PRIMARY KEY AUTO_INCREMENT,
	`player_name` VARCHAR(50),
	`level` INT,
	`exp` INT,
	`guild_id` INT,
	
	FOREIGN KEY (`guild_id`) REFERENCES `Guilds`(`guild_id`)
);

CREATE TABLE `Items`
(
	`item_id` INT PRIMARY KEY AUTO_INCREMENT,
	`item_name` VARCHAR(50),
	`rarity` VARCHAR(50),
	`item_type` VARCHAR(20),
	`player_id` INT,
	
	FOREIGN KEY (`player_id`) REFERENCES `Players`(`player_id`)
);

-- Заполнение таблицы Guilds
INSERT INTO `Guilds` (`guild_name`, `guild_level`) VALUES
('Авангард', 10),
('Тень Ночи', 8),
('Неуязвимые', 12),
('Стальные Волки', 9),
('Легенды Вечности', 15),
('Темная Лига', 7),
('Солнечные Рыцари', 11),
('Титаны', 13),
('Скрытые Звёзды', 6),
('Воины Света', 14);

-- Заполнение таблицы Players
INSERT INTO `Players` (`player_name`, `level`, `exp`, `guild_id`) VALUES
('Алексей', 50, 10000, 1),
('Мария', 45, 8000, 2),
('Дмитрий', 55, 12000, 3),
('Елена', 48, 9000, 4),
('Сергей', 60, 15000, 5),
('Ольга', 42, 7000, 6),
('Анна', 53, 11000, 7),
('Павел', 58, 14000, 8),
('Юлия', 47, 8500, 9),
('Иван', 52, 10500, 10),
('Николай', 49, 9500, 1),
('Татьяна', 44, 7500, 2),
('Александр', 56, 12500, 3),
('Ирина', 46, 8200, 4),
('Владимир', 57, 13000, 5),
('Екатерина', 43, 7200, 6),
('Михаил', 54, 11500, 7),
('Наталья', 51, 10200, 8),
('Виктор', 41, 6800, 9),
('Людмила', 59, 14500, 10);

-- Заполнение таблицы Items
INSERT INTO `Items` (`item_name`, `rarity`, `item_type`, `player_id`) VALUES
('Меч Легенд', 'Легендарный', 'Оружие', 1),
('Щит Защитника', 'Редкий', 'Броня', 2),
('Кольцо Волшебника', 'Эпический', 'Украшение', 3),
('Лук Стрелка', 'Редкий', 'Оружие', 4),
('Шлем Воителя', 'Редкий', 'Броня', 5),
('Плащ Теней', 'Эпический', 'Броня', 6),
('Кольцо Света', 'Легендарный', 'Украшение', 7),
('Меч Дракона', 'Легендарный', 'Оружие', 8),
('Щит Героя', 'Эпический', 'Броня', 9),
('Лук Эльфа', 'Редкий', 'Оружие', 10),
('Шлем Мага', 'Редкий', 'Броня', 11),
('Плащ Волшебника', 'Эпический', 'Броня', 12),
('Кольцо Тьмы', 'Легендарный', 'Украшение', 13),
('Меч Воителя', 'Редкий', 'Оружие', 14),
('Щит Защитника', 'Редкий', 'Броня', 15),
('Лук Стрелка', 'Редкий', 'Оружие', 16),
('Шлем Воителя', 'Редкий', 'Броня', 17),
('Плащ Теней', 'Эпический', 'Броня', 18),
('Кольцо Света', 'Легендарный', 'Украшение', 19),
('Меч Дракона', 'Легендарный', 'Оружие', 20);